#### PerformanceAdviser Members

---

|  |
| --- |
| PerformanceAdviser Class   Methods   Properties   See Also |

The  PerformanceAdviser  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddRule | Adds a performance adviser rule to the list of rules. |
| Public method | DeleteRule | Deletes a performance adviser rule from the list of rules. |
| Public method | Dispose | Releases all resources used by the  PerformanceAdviser |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | ExecuteAllRules | Executes all rules in the list on a given document. |
| Public method | ExecuteRules(Document, IList PerformanceAdviserRuleId ) | Executes selected rules on a given document. |
| Public method | ExecuteRules(Document, IList Int32 ) | Executes selected rules on a given document. |
| Public method | GetAllRuleIds | Retrieves an enumeration of rule Ids. |
| Public method | GetElementFilterFromRule(Int32, Document) | Retrieves a filter to restrict elements to be checked. |
| Public method | GetElementFilterFromRule(PerformanceAdviserRuleId, Document) | Retrieves a filter to restrict elements to be checked. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetNumberOfRules | Retrieves number of performance adviser rules in the list. |
| Public method Static member | GetPerformanceAdviser | Returns the only instance of PerformanceAdviser in the Application. |
| Public method | GetRuleDescription(Int32) | Retrieves the description of the rule. |
| Public method | GetRuleDescription(PerformanceAdviserRuleId) | Retrieves the description of the rule. |
| Public method | GetRuleId | Retrieves an id of a rule for a given index in the list. |
| Public method | GetRuleName(Int32) | Retrieves the name of the rule. |
| Public method | GetRuleName(PerformanceAdviserRuleId) | Retrieves the name of the rule. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsRuleEnabled(Int32) | Retrieves an enabled/disabled status for the given rule. |
| Public method | IsRuleEnabled(PerformanceAdviserRuleId) | Retrieves an enabled/disabled status for the given rule. |
| Public method | PostWarning | Reports a problem detected during execution of a rule. |
| Public method | SetRuleEnabled(Int32, Boolean) | Retrieves an enabled/disabled status for the given rule. |
| Public method | SetRuleEnabled(PerformanceAdviserRuleId, Boolean) | Retrieves an enabled/disabled status for the given rule. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | WillRuleCheckElements(Int32) | Reports if rule needs to be executed on individual elements. |
| Public method | WillRuleCheckElements(PerformanceAdviserRuleId) | Reports if rule needs to be executed on individual elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PerformanceAdviser Class

Autodesk.Revit.DB Namespace